code-examples/napojnica-s-elektronickim-potpisom-926-zahtjev.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:tns="http://www.apis-it.hr/fin/2012/types/f73" 
xmlns:xd="http://www.w3.org/2000/09/xmldsig#"> 
<soapenv:Header/> 
<soapenv:Body> 
<tns:NapojnicaZahtjev Id="racunNapojnicaId"> 
<tns:Zaglavlje> 
<tns:IdPoruke>5ab7fef3-87a0-4f75-b0d4-d83a169ae417</tns:IdPoruke> 
<tns:DatumVrijeme>20.07.2023T09:07:59</tns:DatumVrijeme> 
</tns:Zaglavlje> 
<tns:Racun> 
<tns:Oib>02994650199</tns:Oib> 
<tns:USustPdv>true</tns:USustPdv> 
<tns:DatVrijeme>17.07.2023T11:20:35</tns:DatVrijeme> 
<tns:OznSlijed>P</tns:OznSlijed> 
<tns:BrRac> 
<tns:BrOznRac>238740</tns:BrOznRac> 
<tns:OznPosPr>POSL1</tns:OznPosPr> 
<tns:OznNapUr>12</tns:OznNapUr> 
</tns:BrRac> 
<tns:Pdv> 
<tns:Porez> 
<tns:Stopa>25.00</tns:Stopa> 
<tns:Osnovica>1285.03</tns:Osnovica> 
<tns:Iznos>321.26</tns:Iznos> 
</tns:Porez> 
<tns:Porez> 
<tns:Stopa>0.00</tns:Stopa> 
<tns:Osnovica>445.70</tns:Osnovica> 
<tns:Iznos>0.00</tns:Iznos> 
</tns:Porez> 
</tns:Pdv> 
<tns:Naknade> 
<tns:Naknada> 
<tns:NazivN>Povratna naknada</tns:NazivN> 
<tns:IznosN>7.69</tns:IznosN> 
</tns:Naknada> 
</tns:Naknade> 
<tns:IznosUkupno>2059.68</tns:IznosUkupno> 
<tns:NacinPlac>G</tns:NacinPlac> 
<tns:OibOper>01234567890</tns:OibOper> 
<tns:ZastKod>e70cfa1e73934d7a29147364de95eff0</tns:ZastKod> 
<tns:NakDost>false</tns:NakDost> 
<tns:Napojnica> 
<tns:iznosNapojnice>928.43</tns:iznosNapojnice> 
<tns:nacinPlacanjaNapojnice>T</tns:nacinPlacanjaNapojnice> 
</tns:Napojnica> 
</tns:Racun> 
<Signature xmlns="http://www.w3.org/2000/09/xmldsig#"> 
<SignedInfo> 
<CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/> 
<SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/> 
<Reference URI="#racunNapojnicaId"> 
<Transforms> 
<Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/> 
<Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/> 
</Transforms> 
<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/> 
<DigestValue>gr26FKvG7QJ7NIWyCq4rOmazpbw=</DigestValue> 
</Reference> 
</SignedInfo> 
<SignatureValue>ZKe552tC66g4EYAIoszgEzkTZS0QAC8Fdta9waCQ369VANwh7YpnBv8XuOnM3bkYBRY1
7J8APhH7ySWglojUEvIX11Re/UNmC/13h4bmY/AKkAFBDeTQn3NBLU9dHp4JQJMyX8+SkjN7V1oxUYU4K6
htDZEOT2K8llschNYHUdu0lbFCY0MQP1nb9bmy77dk+OSkHckAJ64IK8vqTHo+yOsXcorjZ7PDKIVCYPRUZU
+eo4emAWTBNn/Vq7Ys83/8/a3CqaW0lymoDiHGL31ODXD2lWW4zTUNPN/acR+bwsp99XD/sHM/eDex3dtl
To/i+iQtCikr11QkaWyiWjeHKQ==</SignatureValue> 
<KeyInfo> 
<X509Data> 
<X509Certificate> 
MIIGjzCCBHegAwIBAgIQVMN+ETtXRMMAAAAAXyRDJDANBgkqhkiG9w0BAQsFADBIMQswCQYDVQQGEwJI
UjEdMBsGA1UEChMURmluYW5jaWpza2EgYWdlbmNpamExGjAYBgNVBAMTEUZpbmEgRGVtbyBDQSAyMDI
wMB4XDTIxMTAxOTA4MjY1NloXDTI2MTAxOTA4MjY1NlowWDELMAkGA1UEBhMCSFIxJTAjBgNVBAoTHEFQ
SVMgSVQgRC5PLk8uIEhSMDI5OTQ2NTAxOTkxDzANBgNVBAcTBlpBR1JFQjERMA8GA1UEAxMIRklTS0FMID
MwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCnVrIj9eExiFKXTB/t6eMBcb6IqzgmHMrJ6L5r5
bUbcg7clP1OTfrOItMyUf2cVAl7B3gjS7rE1Y4LcnApYbx2Mzhfwi/ogmruJpdox32J8LG/1GmOW96Q9zJ/BlqLB
rOBAmQ1i69QonilnbwQWi+XKqMRAqtNkJud6G4404kWiDgdXT6obZshJQaimG4dVd/bBxliGNKPg9nK6ZI2N
g4Vy075ajRe3bq8NseNhlCLB26UL1WShkDNpGYTiN8K8Xyx7JFNpytC3ufS5PhPM8TLjJUYARrACC/CxHulWa
vJd4qVM/8ZYlORhJbBuc1djjpyGsqVgYq5LED51jSCdV8XAgMBAAGjggJjMIICXzAOBgNVHQ8BAf8EBAMCBa
AwHQYDVR0lBBYwFAYIKwYBBQUHAwQGCCsGAQUFBwMCMIGsBgNVHSAEgaQwgaEwgZQGCSt8iFAFIQ8D
ATCBhjBBBggrBgEFBQcCARY1aHR0cDovL2RlbW8tcGtpLmZpbmEuaHIvY3BzL2Nwc25xY2RlbW8yMDE0djIt
MC1oci5wZGYwQQYIKwYBBQUHAgEWNWh0dHA6Ly9kZW1vLXBraS5maW5hLmhyL2Nwcy9jcHNucWNkZW
1vMjAxNHYyLTAtZW4ucGRmMAgGBgQAj3oBATB9BggrBgEFBQcBAQRxMG8wKAYIKwYBBQUHMAGGHGh0
dHA6Ly9kZW1vMjAxNC1vY3NwLmZpbmEuaHIwQwYIKwYBBQUHMAKGN2h0dHA6Ly9kZW1vLXBraS5maW
5hLmhyL2NlcnRpZmlrYXRpL2RlbW8yMDIwX3N1Yl9jYS5jZXIwgbQGA1UdHwSBrDCBqTCBpqCBo6CBoIYoa
HR0cDovL2RlbW8tcGtpLmZpbmEuaHIvY3JsL2RlbW8yMDIwLmNybIZ0bGRhcDovL2RlbW8tbGRhcC5maW5
hLmhyL2NuPUZpbmElMjBEZW1vJTIwQ0ElMjAyMDIwLG89RmluYW5jaWpza2ElMjBhZ2VuY2lqYSxjPUhSP2
NlcnRpZmljYXRlUmV2b2NhdGlvbkxpc3QlM0JiaW5hcnkwHwYDVR0jBBgwFoAUla9S1cLp1zeEPm5Jj8kf6lwr
X88wHQYDVR0OBBYEFHbh5aGV7SnN828H+8jZ/1kRMgkmMAkGA1UdEwQCMAAwDQYJKoZIhvcNAQELBQ
ADggIBAGZLzwPNAnhYAESsDRLdnZ/7a7uoKLOTh0hNUgqESGOkB8xcuQFHHKLwQlmFdv+/2i3WPT4aXg0
PNPFIlNLABIlnZEJfhpAsnswCBcZfBMTFqmOUlJkQIghSSVHm7yC2eJBiB9x/PnZQzd2FteHOprT5exd2wvHIh
QEtmLDpI+hDNv6zvBxrRcz6aT4v5KfmkP5O4z1jj5y4Ug5Su7TX2KpT/zRNPPPQXsqg+dS+6C+FJFG7UFRH
EMSvAc2BFDm+T8UXUIXE61jSOj/Dw1g2mSSdJFLNrB8T0hWaj7EX32sEd0KGQJmBsK4hMiUmV96ZmJFcJ
ksiuwPcAbXLdvJt8R6T9KuVsxMBKt7QVYFd723o2hiPTCbc/2LrwAIpAIsinlOi238SyNvVqvsuRVe8EWKZo+KV
9JZ9IQksz/vXNehGt/f4NCfGqZZiWndbp1DewISSLifqlKyGzghC49jwUu03HD86RRFYw6l6BNf0s9s2YyppEnd
TCJWruaX+YYEYxulVBY0E4hohidwWBCGg4wWKWEUYBnHuzaSTEzx6KQUZtRoxuISPGujE6fwb4oSExQ3Fc
URRszb+kwajXiptZk1kJrbF5GBYeGq74mFRth+pRaoEWWdGzz38Az6GXD+dg9FhqCvj6Z5PzH80VoVso9YQ
VauOWavRdfIgDIxLenNx</X509Certificate> 
<X509IssuerSerial> 
<X509IssuerName>CN=Fina Demo CA 2020,O=Financijska agencija,C=HR</X509IssuerName> 
<X509SerialNumber>112670206482201164408252157595450884900</X509SerialNumber> 
</X509IssuerSerial> 
</X509Data> 
</KeyInfo> 
</Signature> 
</tns:NapojnicaZahtjev> 
</soapenv:Body> 
</soapenv:Envelope>